Repository: HaiKamDesu/BBCF-Improvement-Mod
Catalog: resource/localization/Localization.*.resx
Languages: es

# _LanguageCode
source: en
es: es

# _DisplayName
source: English
es: Español

source: Toggle me with %s
es: Activa la ventana con %s

source: Toggle Online with %s
es: Abrir en línea con %s

source: Toggle HUD with %s
es: Ocultar HUD con %s

source: Generate Debug Logs
es: Generar registros de depuración

source: Write DEBUG.txt with detailed runtime information. Saved to settings.ini for future sessions.
es: Escribe DEBUG.txt con información detallada de ejecución. Se guarda en settings.ini para futuras sesiones.

source: Online
es: En línea

source: Gameplay settings
es: Opciones de juego

source: Custom palettes
es: Paletas personalizadas

source: Hitbox overlay
es: Superposición de hitbox

source: FrameHistory
es: Historial de cuadros

source: Framedata
es: Datos de cuadro

source: Avatar settings
es: Opciones de avatar

source: Controller Settings
es: Opciones de control

source: Local Controller Override
es: Anulación de controlador local

source: Choose which connected controller or the keyboard should be Player 1 and Player 2. Use Refresh when devices change.
es: Elige qué controlador conectado o el teclado deben ser Jugador 1 y Jugador 2. Usa Actualizar cuando cambien los dispositivos.

source: Refresh controllers
es: Actualizar controladores

source: Reload the controller list and reinitialize input slots to match connected devices.
es: Recarga la lista de controladores y reinicializa las ranuras de entrada para coincidir con los dispositivos conectados.

source: Open Joy.cpl
es: Abrir Joy.cpl

source: Auto-refresh
es: Actualización automática

source: Automatically refresh controller slots when devices change. The internal call to refresh controllers may freeze the game for a few moments, so only enable this if you are okay with short pauses.
es: Actualiza automáticamente las ranuras de controladores cuando cambian los dispositivos. La llamada interna para actualizarlos puede congelar el juego por unos momentos, así que actívalo solo si aceptas pausas cortas.

source: No input devices detected.
es: No se detectaron dispositivos de entrada.

source: ON
es: ACTIVADO

source: OFF
es: DESACTIVADO

source: Steam Input appears to be active. This will disable some of this section's features.
es: Steam Input parece estar activo. Esto deshabilitará algunas funciones de esta sección.

source: The internal behavior of Steam Input hides some controllers from the game's process, thus making some controller related features impossible/work in unintended ways. The disabled features include: - Local Controller Override - Opening Joy.cpl
es: El comportamiento interno de Steam Input oculta algunos controladores del proceso del juego, lo que hace que ciertas funciones relacionadas con controladores sean imposibles o funcionen de forma inesperada. Las funciones deshabilitadas incluyen: >- Anulación de controlador local >- Abrir Joy.cpl

source: Swap P1 Controller to P2
es: Cambiar el controlador de P1 a P2

source: Changes P1 Controller's assignment so it is recognized as P2. Internally, this is just swapping p1 with p2's game controllers.
es: Cambia la asignación del controlador de P1 para que se reconozca como P2. Internamente solo intercambia los controladores de juego de P1 con los de P2.

source: Multiple keyboards override
es: Reasignación de múltiples teclados

source: Choose which physical keyboards should be treated as Player 1 when multiple keyboards are connected. All other keyboards will drive Player 2 using their saved mappings (defaults to WASD/JIKL).
es: Elige qué teclados físicos deben ser el Jugador 1 cuando haya varios conectados. El resto controlará al Jugador 2 usando sus asignaciones guardadas (por defecto WASD/JIKL).

source: No keyboards selected
es: No hay teclados seleccionados

source: No keyboards detected.
es: No se detectaron teclados.

source: P1 Keyboards
es: Teclados de P1

source: Map
es: Asignar

source: Rename
es: Renombrar

source: Ignore
es: Ignorar

source: Rename keyboard
es: Renombrar teclado

source: Set a custom name for this keyboard.
es: Define un nombre personalizado para este teclado.

source: Save
es: Guardar

source: Cancel
es: Cancelar

source: Clear
es: Borrar

source: Configure keyboard mapping
es: Configurar asignación de teclado

source: Unbound
es: Sin asignar

source: Press a key...
es: Pulsa una tecla...

source: Bind
es: Vincular

source: Menu action
es: Acción de menú

source: Battle action
es: Acción en combate

source: Close
es: Cerrar

source: Set all to default
es: Restablecer todo a los valores predeterminados

source: Ignored keyboards
es: Teclados ignorados

source: No ignored keyboards.
es: No hay teclados ignorados.

source: Unignore
es: Dejar de ignorar

source: (connected)
es: (conectado)

source: (not connected)
es: (desconectado)

source: Mapping for %s
es: Asignación para %s

source: Test
es: Probar

source: Player 1 Controller
es: Controlador del Jugador 1

source: Player 2 Controller
es: Controlador del Jugador 2

source: Loaded settings.ini values
es: Valores cargados de settings.ini

source: Current online players:
es: Jugadores en línea actuales:

# &lt;No data&gt;
source: <No data>
es: <Sin datos>

source: Accessory 1
es: Accesorio 1

source: Accessory 2
es: Accesorio 2

source: CONNECT TO NETWORK MODE FIRST
es: CONECTA AL MODO EN LÍNEA PRIMERO

# FrameHistory help
source: For each non-idle frame, display a column of rectangles with info about it. For each player : = The first row displays player state. - Startup->green - Active->red - Recovery->blue - Blockstun->yellow - Hitstun->purple - Hard landing recovery->blush - Special: hard to classify states(e.g.dashes)->Aquamarine = Second row is for invul/armor. The position of the line segments indicates the attributes, and its color if invul or armor: - Invul->white - Armor->brown - H->top segment - B->middle segment - F->bottom segment - T->left segment - P->right segment
es: Para cada cuadro no inactivo, muestra una columna de rectángulos con información. Para cada jugador: = La primera fila muestra el estado del jugador. - Inicio->verde - Activo->rojo - Recuperación->azul - Aturdimiento por bloqueo->amarillo - Aturdimiento por golpe->morado - Recuperación por caída dura->rosa - Especial: estados difíciles de clasificar (p.ej. dashes)->aguamarina = La segunda fila es para invulnerabilidad/armadura. La posición de los segmentos indica los atributos y su color si hay invul o armadura: - Invul->blanco - Armadura->marrón - H->segmento superior - B->segmento medio - F->segmento inferior - T->segmento izquierdo - P->segmento derecho

# FrameHistory auto reset help
source: block auto-reset on an idle frame: Do not overwrite automatically after an idle frame.
es: Bloquear el reinicio automático en un cuadro inactivo: no sobrescribir automáticamente después de un cuadro inactivo.

source: Box width
es: Ancho de caja

source: Box height
es: Alto de caja

source: spacing
es: Espaciado

source: Enable##framehistory_section
es: Activar##framehistory_section

source: Auto Reset##Reset after each idle frame
es: Reinicio automático##Reset after each idle frame

source: Enable##framedata_section
es: Activar##framedata_section

source: Advantage on stagger hit
es: Ventaja en golpe tambaleante

source: YOU ARE NOT IN MATCH!
es: ¡NO ESTÁS EN UNA PARTIDA!

source: YOU ARE NOT IN TRAINING MODE OR REPLAY THEATER!
es: ¡NO ESTÁS EN ENTRENAMIENTO NI EN REPLAY THEATER!

source: YOU ARE NOT IN A MATCH, IN TRAINING MODE OR REPLAY THEATER!
es: ¡NO ESTÁS EN PARTIDA, ENTRENAMIENTO NI REPLAY THEATER!

source: THERE WAS AN ERROR LOADING ONE/BOTH OF THE CHARACTERS
es: HUBO UN ERROR AL CARGAR UNO O AMBOS PERSONAJES

source: Palette editor
es: Editor de paletas

# YOU ARE NOT IN MATCH! (Replay)
source: YOU ARE NOT IN MATCH!
es: ¡NO ESTÁS EN UNA PARTIDA!

source: YOU ARE NOT IN REPLAY MENU!
es: ¡NO ESTÁS EN EL MENÚ DE REPLAY!

source: YOU ARE NOT IN CHARACTER SELECTION!
es: ¡NO ESTÁS EN LA SELECCIÓN DE PERSONAJE!

source: Hide HUD
es: Ocultar HUD

source: Toggle Rewind
es: Alternar rebobinado

source: Replay Database
es: Base de datos de repeticiones

source: Enable/Disable Automatic Replay Uploads?
es: ¿Activar/Desactivar las cargas automáticas de repeticiones?

source: IM BOBLEIS can automatically upload your replays to a public central repository. This feature allows: - Easy sharing: Facilitates sharing of replays between players. - Community sharing: Contribute to a collection of matches for learning and analysis. - Cataloging: Easily search by characters for matchups. - Storage: Keep your replays backed up automatically after the 100 limit. You can access the database using the Replay Database button on the IM main menu. If you disable it your replays won't be uploaded even if matched with someone with it enabled. If you wish to turn it off/on again you can access this menu using the button on the IM main menu or using settings.ini. This has no impact on performance or stability. Would you like to leave automatic replay uploads on or turn it off?
es: IM BOBLEIS puede subir automáticamente tus repeticiones a un repositorio público central. Esta función permite: - Uso compartido sencillo: facilita compartir repeticiones entre jugadores. - Compartir con la comunidad: contribuye a una colección de partidas para aprender y analizar. - Catalogación: busca fácilmente por personajes para estudiar emparejamientos. - Almacenamiento: mantiene tus repeticiones respaldadas automáticamente después del límite de 100. Puedes acceder a la base de datos mediante el botón Replay Database en el menú principal de IM. Si la desactivas tus repeticiones no se subirán incluso si juegas contra alguien que la tenga activada. Si deseas volver a activarla o desactivarla puedes abrir este menú con el botón en el menú principal de IM o con settings.ini. Esto no tiene impacto en el rendimiento ni en la estabilidad. ¿Quieres dejar activadas las cargas automáticas de repeticiones o desactivarlas?

source: Enable/Disable Upload
es: Activar/Desactivar subida

source: Forum
es: Foro

source: Player1
es: Jugador 1

source: Player2
es: Jugador 2

source: Draw hitbox/hurtbox
es: Dibujar hitbox/hurtbox

source: Draw origin
es: Dibujar origen

source: Draw collision
es: Dibujar colisión

source: Draw throw/range boxes
es: Dibujar cajas de agarre/rango

source: The point in space where your character resides. Important!: This is a single point, the render is composed of two lines to facilitate viewing, the actual point is where the two lines touch.
es: El punto en el espacio donde reside tu personaje. Importante: es un único punto; el renderizado muestra dos líneas para facilitar la vista, el punto real está donde se cruzan.

source: Defines collision between objects/characters. Also used for throw range checks.
es: Define la colisión entre objetos/personajes. También se usa para comprobar el alcance de agarres.

# Throw range help
source: Throw Range Box(yellow): All throws require the throw range check. In order to pass this check the throw range box must overlap target's collision box. Move Range Box(green): All throws and some moves require the move range check. In order to pass this check the move range box must overlap the target's origin point. How do throws connect? In order for a throw to connect you must have satisfy the following conditions: 1: Both players must be on the ground or in the air. This is decided by their origin position, not sprite. 2: You must pass the move range check. 3: You must pass the throw range check. 4: The hitbox of the throw must overlap the hurtbox of the target. 5: The target must not be throw immune.
es: Caja de rango de agarre (amarillo): todos los agarres requieren superar esta comprobación; la caja debe solaparse con la caja de colisión del objetivo. Caja de rango de movimiento (verde): todos los agarres y algunos movimientos requieren esta comprobación; la caja debe solaparse con el punto de origen del objetivo. ¿Cómo conecta un agarre? Para que conecte debes cumplir: 1: Ambos jugadores en tierra o aire (según su origen, no el sprite). 2: Pasar la comprobación de rango de movimiento. 3: Pasar la comprobación de rango de agarre. 4: La hitbox del agarre debe solapar la hurtbox del objetivo. 5: El objetivo no debe ser inmune a agarres.

source: Freeze frame:
es: Congelar cuadro:

source: Frame Count
es: Contador de cuadros

source: Reset
es: Reiniciar

source: Freeze animation
es: Congelar animación

source: Stop timer
es: Detener temporizador

source: Step frames
es: Avanzar cuadros

source: YOU ARE NOT IN TRAINING, VERSUS, OR REPLAY!
es: ¡NO ESTÁS EN ENTRENAMIENTO, VERSUS O REPLAY!

source: Game Mode
es: Modo de juego

source: Enable##hitbox_overlay_section
es: Activar##hitbox_overlay_section

# Custom palette reload
source: Reload all palettes
es: Recargar todas las paletas

# Enable##framehistory_section checkbox
source: Enable##framehistory_section
es: Activar

# Draw hitbox/hurtbox##hitbox_overlay_section
source: Draw hitbox/hurtbox
es: Dibujar hitbox/hurtbox

# Draw origin##hitbox_overlay_section
source: Draw origin
es: Dibujar origen

# Draw collision##hitbox_overlay_section
source: Draw collision
es: Dibujar colisión

# Step frames##hitbox_overlay_section
source: Step frames
es: Avanzar cuadros

# Gameplay settings header
source: Gameplay settings
es: Opciones de juego

# Hide HUD checkbox
source: Hide HUD
es: Ocultar HUD

source: States
es: Estados

source: Log
es: Registro

source: Replay Rewind
es: Rebobinado de repetición

source: Replay Upload
es: Subida de repetición

# Enable##framehistory_section label
source: Enable
es: Activar

# Auto Reset label
source: Auto Reset
es: Reinicio automático

# FrameHistory width label
source: Box width
es: Ancho de caja

# FrameHistory height label
source: Box height
es: Alto de caja

# FrameHistory spacing label
source: spacing
es: Espaciado

# FrameHistory not enabled message
source: YOU ARE NOT IN A MATCH, IN TRAINING MODE OR REPLAY THEATER!
es: ¡NO ESTÁS EN UNA PARTIDA, ENTRENAMIENTO NI REPLAY THEATER!

# FrameHistory character load error
source: THERE WAS AN ERROR LOADING ONE/BOTH OF THE CHARACTERS
es: HUBO UN ERROR AL CARGAR UNO O AMBOS PERSONAJES

source: Language
es: Idioma

# Language incomplete label
source: %s - Incomplete (Missing %zu terms)
es: %s - Incompleto (faltan %zu términos)

# Language selection help
source: Select a language for all UI text. Requires full dictionary coverage.
es: Selecciona un idioma para todo el texto de la interfaz. Requiere cobertura completa del diccionario.

# KoreWaTestoDakeDa
source: dsdsd
es: asasasasa
